oleg-it-com/sdk-nrf/samples/bluetooth/nrf54l15_unicast_server/src/main.c
	int ret;

	/* Buffer size in 32-bit words */
	ret = nrfx_i2s_start(&i2s_inst, &i2s_buf, 0);
	if (ret != NRFX_SUCCESS) {
		printf("Failed to start I2S: %d\n", ret);
	}
}

void audio_i2s_init(void)
{
	int ret;

	ret = pinctrl_apply_state(PINCTRL_DT_DEV_CONFIG_GET(I2S_NL), PINCTRL_STATE_DEFAULT);
	if (ret != 0) {
		printf("Failed to apply pinctrl state: %d\n", ret);
		return;
	}

	IRQ_CONNECT(DT_IRQN(I2S_NL), DT_IRQ(I2S_NL, priority), nrfx_isr, nrfx_i2s_20_irq_handler, 0);
	irq_enable(DT_IRQN(I2S_NL));

	ret = nrfx_i2s_init(&i2s_inst, &cfg, i2s_comp_handler);
	if (ret != NRFX_SUCCESS) {
		printf("Failed to initialize I2S: %x\n", ret);
		return;
	}
}

static int clocks_start(void)
{
	int err;
	int res;
	struct onoff_manager *clk_mgr;
	struct onoff_client clk_cli;

	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (!clk_mgr) {
		printf("Unable to get the Clock manager\n");
		return -ENXIO;
	}

	sys_notify_init_spinwait(&clk_cli.notify);

	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		printf("Clock request failed: %d\n", err);
		return err;
	}

	do {
		err = sys_notify_fetch_result(&clk_cli.notify, &res);
		if (!err && res) {
			printf("Clock could not be started: %d\n", res);
			return res;
		}
	} while (err);

#if defined(NRF54L15_XXAA)
	/* MLTPAN-20 */
	nrf_clock_task_trigger(NRF_CLOCK, NRF_CLOCK_TASK_PLLSTART);
#endif /* defined(NRF54L15_XXAA) */

	printf("HF clock started\n");
	return 0;
}


void dac_i2c_write(const struct i2c_dt_spec *dev_i2c, uint8_t reg, uint8_t value)
{
	int ret;
	uint8_t config[2] = {reg, value};

	ret = i2c_write_dt(dev_i2c, config, sizeof(config));
	if (ret != 0) {
		printf("Failed to write to I2C device address %x at reg. %x\n", dev_i2c->addr, reg);
	} else {
		//printf("I2C device address %x at reg. %x written successfully\n", dev_i2c->addr,
		//       reg);
	}
}

void tlv320_setup(void)
{
	static const struct i2c_dt_spec dev_i2c = I2C_DT_SPEC_GET(I2C_NODE);

	if (!device_is_ready(dev_i2c.bus)) {
		printf("I2C bus %s is not ready!\n", dev_i2c.bus->name);
		return;
	} else {
		printf("I2C bus %s is ready!\n", dev_i2c.bus->name);
	}

	dac_i2c_write(&dev_i2c, 0x00, 0x00);

	dac_i2c_write(&dev_i2c, 0x01, 0x01);
	k_sleep(K_MSEC(10));

	dac_i2c_write(&dev_i2c, 0x04, 0x03 | (0b11 << 0));
	dac_i2c_write(&dev_i2c, 0x05, (0b001 << 4) | (0b0001 << 0));
	dac_i2c_write(&dev_i2c, 0x06, 0x05);
	dac_i2c_write(&dev_i2c, 0x07, 0x0E);
	dac_i2c_write(&dev_i2c, 0x08, 0xB0);

	dac_i2c_write(&dev_i2c, 0x05, (1 << 7) | (0b001 << 4) | (0b0001 << 0));
	k_sleep(K_MSEC(15));

	dac_i2c_write(&dev_i2c, 0x0B, 0x87);
	dac_i2c_write(&dev_i2c, 0x0C, 0x82);
	dac_i2c_write(&dev_i2c, 0x0D, 0x00);
	dac_i2c_write(&dev_i2c, 0x0E, 0x80);

	dac_i2c_write(&dev_i2c, 0x1B, 0x0C);
	dac_i2c_write(&dev_i2c, 0x1E, 0x84);
	dac_i2c_write(&dev_i2c, 0x1D, (0b01 << 0));
	dac_i2c_write(&dev_i2c, 0x3C, 0x01);
	dac_i2c_write(&dev_i2c, 0x74, 0x00);

	dac_i2c_write(&dev_i2c, 0x00, 0x01);
	dac_i2c_write(&dev_i2c, 0x1F, (0b00 << 3));
	dac_i2c_write(&dev_i2c, 0x21, (0b0111 << 3) | (0b11 << 1));
	dac_i2c_write(&dev_i2c, 0x23, 0x44);
	dac_i2c_write(&dev_i2c, 0x24, 0x80);
	dac_i2c_write(&dev_i2c, 0x25, 0x80);
	dac_i2c_write(&dev_i2c, 0x28, 0x06);
	dac_i2c_write(&dev_i2c, 0x29, 0x06);
	dac_i2c_write(&dev_i2c, 0x1F, 0xC0 | (0b00 << 3));
	// dac_i2c_write(&dev_i2c, 0x20, 0x80);

	k_sleep(K_MSEC(300));

	dac_i2c_write(&dev_i2c, 0x00, 0x00);
	dac_i2c_write(&dev_i2c, 0x3F, 0xD4);
	dac_i2c_write(&dev_i2c, 0x41, -60);
	dac_i2c_write(&dev_i2c, 0x42, -60);
	dac_i2c_write(&dev_i2c, 0x40, 0x00);
	dac_i2c_write(&dev_i2c, 0x00, 0x00);
}


void print_hex(const uint8_t *ptr, size_t len)
{
	while (len-- != 0) {
		printk("%02x", *ptr++);
	}
}

static bool print_cb(struct bt_data *data, void *user_data)
{
	const char *str = (const char *)user_data;

	LOG_INF("%s: type 0x%02x value_len %u", str, data->type, data->data_len);
	LOG_HEXDUMP_INF(data->data, data->data_len, "value:");

	return true;
}

static void print_codec_cfg(const struct bt_audio_codec_cfg *codec_cfg)
{
	LOG_INF("codec_cfg 0x%02x cid 0x%04x vid 0x%04x count %u", codec_cfg->id, codec_cfg->cid,
	       codec_cfg->vid, codec_cfg->data_len);

	if (codec_cfg->id == BT_HCI_CODING_FORMAT_LC3) {
		enum bt_audio_location chan_allocation;
		int ret;

		/* LC3 uses the generic LTV format - other codecs might do as well */

		bt_audio_data_parse(codec_cfg->data, codec_cfg->data_len, print_cb, "data");

		ret = bt_audio_codec_cfg_get_freq(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frequency: %d Hz", bt_audio_codec_cfg_freq_to_freq_hz(ret));
		}

		ret = bt_audio_codec_cfg_get_frame_dur(codec_cfg);
		if (ret > 0) {
			LOG_INF("  Frame Duration: %d us",
			       bt_audio_codec_cfg_frame_dur_to_frame_dur_us(ret));
		}

		ret = bt_audio_codec_cfg_get_chan_allocation(codec_cfg, &chan_allocation, false);
		if (ret == 0) {
			LOG_INF("  Channel allocation: 0x%x", chan_allocation);
		}

		LOG_INF("  Octets per frame: %d (negative means value not pressent)",
		       bt_audio_codec_cfg_get_octets_per_frame(codec_cfg));
		LOG_INF("  Frames per SDU: %d",
		       bt_audio_codec_cfg_get_frame_blocks_per_sdu(codec_cfg, true));
	} else {
		print_hex(codec_cfg->data, codec_cfg->data_len);
	}

	bt_audio_data_parse(codec_cfg->meta, codec_cfg->meta_len, print_cb, "meta");
}

static void print_qos(const struct bt_bap_qos_cfg *qos)
{
	LOG_INF("QoS: interval %u framing 0x%02x phy 0x%02x sdu %u "
	       "rtn %u latency %u pd %u",
	       qos->interval, qos->framing, qos->phy, qos->sdu,
	       qos->rtn, qos->latency, qos->pd);
}

static enum bt_audio_dir stream_dir(const struct bt_bap_stream *stream)
{
	for (size_t i = 0U; i < ARRAY_SIZE(source_streams); i++) {
		if (stream == &source_streams[i].stream) {
			return BT_AUDIO_DIR_SOURCE;
		}
	}

	for (size_t i = 0U; i < ARRAY_SIZE(sink_streams); i++) {
		if (stream == &sink_streams[i]) {
			return BT_AUDIO_DIR_SINK;
		}
	}

	__ASSERT(false, "Invalid stream %p", (void *) stream);
	return 0;
}

static struct bt_bap_stream *stream_alloc(enum bt_audio_dir dir)
{
	if (dir == BT_AUDIO_DIR_SOURCE) {
		for (size_t i = 0; i < ARRAY_SIZE(source_streams); i++) {
			struct bt_bap_stream *stream = &source_streams[i].stream;

			if (!stream->conn) {
				return stream;
			}
		}
	} else {
		for (size_t i = 0; i < ARRAY_SIZE(sink_streams); i++) {
			struct bt_bap_stream *stream = &sink_streams[i];

			if (!stream->conn) {
				return stream;
			}
		}
	}

