oleg-it-com/sdk-nrf/samples/bluetooth/nrf54l15_unicast_server/src/main.c
	return NULL;
}

static int lc3_config(struct bt_conn *conn, const struct bt_bap_ep *ep, enum bt_audio_dir dir,
		      const struct bt_audio_codec_cfg *codec_cfg, struct bt_bap_stream **stream,
		      struct bt_bap_qos_cfg_pref *const pref, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("ASE Codec Config: conn %p ep %p dir %u", (void *) conn, (void *) ep, dir);

	print_codec_cfg(codec_cfg);

	*stream = stream_alloc(dir);
	if (*stream == NULL) {
		LOG_INF("No streams available");
		*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_NO_MEM, BT_BAP_ASCS_REASON_NONE);

		return -ENOMEM;
	}

	LOG_INF("ASE Codec Config stream %p", (void *) *stream);

	if (dir == BT_AUDIO_DIR_SOURCE) {
		configured_source_stream_count++;
	}

	*pref = qos_pref;

	/* Nothing to free as static memory is used */
	for (int i = 0; i < 2; i++) {
			lc3_decoder[i] = NULL;
	}

	return 0;
}

static int lc3_reconfig(struct bt_bap_stream *stream, enum bt_audio_dir dir,
			const struct bt_audio_codec_cfg *codec_cfg,
			struct bt_bap_qos_cfg_pref *const pref, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("ASE Codec Reconfig: stream %p", (void *)stream);

	print_codec_cfg(codec_cfg);

	/* Nothing to free as static memory is used */
	for(int i = 0; i < 2; i++) {
		lc3_decoder[i] = NULL;
	}

	*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_CONF_UNSUPPORTED, BT_BAP_ASCS_REASON_NONE);

	/* We only support one QoS at the moment, reject changes */
	return -ENOEXEC;
}

static int lc3_qos(struct bt_bap_stream *stream, const struct bt_bap_qos_cfg *qos,
		   struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("QoS: stream %p qos %p", (void *)stream, (void *)qos);

	print_qos(qos);

	for (size_t i = 0U; i < configured_source_stream_count; i++) {
		if (stream == &source_streams[i].stream) {
			source_streams[i].max_sdu = qos->sdu;
			break;
		}
	}

	return 0;
}

static int lc3_enable(struct bt_bap_stream *stream, const uint8_t meta[], size_t meta_len,
		      struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Enable: stream %p meta_len %zu", (void *)stream, meta_len);

	int frame_duration_us;
	int freq;
	int ret;

	ret = bt_audio_codec_cfg_get_freq(stream->codec_cfg);
	if (ret > 0) {
		freq = bt_audio_codec_cfg_freq_to_freq_hz(ret);
	} else {
		LOG_INF("Error: Codec frequency not set, cannot start codec.");
		*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_CONF_INVALID,
						BT_BAP_ASCS_REASON_CODEC_DATA);
		return ret;
	}

	ret = bt_audio_codec_cfg_get_frame_dur(stream->codec_cfg);
	if (ret > 0) {
		frame_duration_us = bt_audio_codec_cfg_frame_dur_to_frame_dur_us(ret);
	} else {
		LOG_INF("Error: Frame duration not set, cannot start codec.");
		*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_CONF_INVALID,
						BT_BAP_ASCS_REASON_CODEC_DATA);
		return ret;
	}

	frames_per_sdu =
		bt_audio_codec_cfg_get_frame_blocks_per_sdu(stream->codec_cfg, true);

	for (int i = 0; i <2; i++){
		lc3_decoder[i] = lc3_setup_decoder(frame_duration_us,
						freq,
						0, /* No resampling */
						&lc3_decoder_mem[i]);

		if (lc3_decoder[i] == NULL) {
			LOG_INF("ERROR: Failed to setup LC3 encoder - wrong parameters?");
			*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_CONF_INVALID,
						BT_BAP_ASCS_REASON_CODEC_DATA);
			return -1;
		}
	}


	return 0;
}

static int lc3_start(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Start: stream %p", (void *)stream);

	for (size_t i = 0U; i < configured_source_stream_count; i++) {
		if (stream == &source_streams[i].stream) {
			source_streams[i].seq_num = 0U;
			source_streams[i].len_to_send = 0U;
			break;
		}
	}

	if (configured_source_stream_count > 0 &&
	    !k_work_delayable_is_pending(&audio_send_work)) {

		/* Start send timer */
		k_work_schedule(&audio_send_work, K_MSEC(0));
	}

	return 0;
}

static bool data_func_cb(struct bt_data *data, void *user_data)
{
	struct bt_bap_ascs_rsp *rsp = (struct bt_bap_ascs_rsp *)user_data;

	if (!BT_AUDIO_METADATA_TYPE_IS_KNOWN(data->type)) {
		LOG_INF("Invalid metadata type %u or length %u", data->type, data->data_len);
		*rsp = BT_BAP_ASCS_RSP(BT_BAP_ASCS_RSP_CODE_METADATA_REJECTED, data->type);

		return -EINVAL;
	}

	return true;
}

static int lc3_metadata(struct bt_bap_stream *stream, const uint8_t meta[], size_t meta_len,
			struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Metadata: stream %p meta_len %zu", (void *)stream, meta_len);

	return bt_audio_data_parse(meta, meta_len, data_func_cb, rsp);
}

static int lc3_disable(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Disable: stream %p", (void *)stream);

	return 0;
}

static int lc3_stop(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Stop: stream %p", (void *)stream);

	return 0;
}

static int lc3_release(struct bt_bap_stream *stream, struct bt_bap_ascs_rsp *rsp)
{
	LOG_INF("Release: stream %p", (void *)stream);
	return 0;
}

static struct bt_bap_unicast_server_register_param param = {
	CONFIG_BT_ASCS_MAX_ASE_SNK_COUNT,
	CONFIG_BT_ASCS_MAX_ASE_SRC_COUNT
};

static const struct bt_bap_unicast_server_cb unicast_server_cb = {
	.config = lc3_config,
	.reconfig = lc3_reconfig,
	.qos = lc3_qos,
	.enable = lc3_enable,
	.start = lc3_start,
	.metadata = lc3_metadata,
	.disable = lc3_disable,
	.stop = lc3_stop,
	.release = lc3_release,
};

static void stream_recv_lc3_codec(struct bt_bap_stream *stream,
				  const struct bt_iso_recv_info *info,
				  struct net_buf *buf)
{
	const bool valid_data = (info->flags & BT_ISO_FLAGS_VALID) != 0;
	const int octets_per_frame = buf->len / frames_per_sdu;

	for (int i = 0; i < 2; i++) {
		if (lc3_decoder[i] == NULL) {
			LOG_INF("LC3 decoder not setup, cannot decode data.");
			return;
		}
	}


	if (!valid_data) {
		LOG_INF("Bad packet: 0x%02X", info->flags);
	}
	int16_t audio_buf_test[2*480];
	//LOG_INF("RX stream %p len %u", stream, buf->len);
	uint16_t buf_size;
	static uint16_t prev_buf_size = 0;


	buf_size = ring_buf_space_get(&i2s_tx_ring_buf);
	if (buf_size != prev_buf_size) {
		prev_buf_size = buf_size;
		LOG_INF("I2S TX ring buffer space: %d bytes", buf_size);
	}

	for (int i = 0; i < frames_per_sdu; i++) {
		for (int j = 0; j < 2; j++) {
			const int err = lc3_decode(
				lc3_decoder[j],
				valid_data ? net_buf_pull_mem(buf, octets_per_frame / 2) : NULL,
				octets_per_frame / 2, LC3_PCM_FORMAT_S16, audio_buf_test+j, 2);
			if (err == 1) {
				LOG_INF("[%d]: Decoder performed PLC", i);
			} else if (err < 0) {
				LOG_INF("[%d]: Decoder failed - wrong parameters?: %d", i, err);
			}
		}
	}
	ring_buf_put(&i2s_tx_ring_buf, (uint8_t *)audio_buf_test, 480 * 2 * sizeof(int16_t));
}


static void stream_stopped(struct bt_bap_stream *stream, uint8_t reason)
{
	LOG_INF("Audio Stream %p stopped with reason 0x%02X", (void *)stream, reason);

	/* Stop send timer */
	k_work_cancel_delayable(&audio_send_work);
}

static void stream_started(struct bt_bap_stream *stream)
{
	LOG_INF("Audio Stream %p started", (void *)stream);
}

static void stream_enabled_cb(struct bt_bap_stream *stream)
{
	/* The unicast server is responsible for starting sink ASEs after the
	 * client has enabled them.
	 */
	if (stream_dir(stream) == BT_AUDIO_DIR_SINK) {
		const int err = bt_bap_stream_start(stream);

		if (err != 0) {
			LOG_INF("Failed to start stream %p: %d", (void *)stream, err);
		}
	}
}

static struct bt_bap_stream_ops stream_ops = {
	.recv = stream_recv_lc3_codec,
	.stopped = stream_stopped,
	.started = stream_started,
	.enabled = stream_enabled_cb,
};

static void advertising_process(struct k_work *work)
{
       int err;
       err = bt_le_ext_adv_start(adv, BT_LE_EXT_ADV_START_DEFAULT);
       if (err) {
               LOG_INF("Failed to start advertising set (err %d)", err);
       }
       LOG_INF("Advertising successfully started");
}

